reference_cfd/openfoam_v2606/flat_plate/medium_incidence_15deg/0/Ydefault
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object Ydefault;
}

dimensions [0 0 0 0 0 0 0];
internalField uniform 0;

boundaryField
{
    airInlet
    {
        type fixedValue;
        value uniform 0;
    }
    targetWall
    {
        type zeroGradient;
    }
    farField
    {
        type inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }
}
